app/controllers/api/v1/meals_controller.rb

	def create
		 @meal = Meal.new(meal_params)
		 @user = User.find(meal_params[:user_id])
    if @meal.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "meals" ("name", "date_string", "date_date", "image_url", "total_cal", "total_protein", "total_fat", "total_carbs", "category", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"